# EndExportInternal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..EndExportInternal Method
ExporterIFCUtils Class See Also
---
Use the internal Revit implementation to relate elements at the end of export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static void EndExportInternal(
	ExporterIFC exporterIFC
)
```

Visual Basic
---
```text
Public Shared Sub EndExportInternal ( _
	exporterIFC As ExporterIFC _
)
```

Visual C++
---
```text
public:
static void EndExportInternal(
	ExporterIFC^ exporterIFC
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace